{"text":{"0":"🔥🔥🔥🔥🔥🔥","1":"Devolución en H&M un desastre ! Nunca uséis el buzón de devolución porque yo no recibí mi dinero aún después de 7 días !","2":"#BoycottHM #CANCELED #NotoColonizationFunders #FreePalestine #Blockout2024 🔻🔻🔻🔻🇵🇸🇵🇸🇵🇸✌✌✌","3":"I want that dress but not going to buy it after finding out your company uses forced labor \nYou lost a customer and I’m taking all my followers with me","4":"😍😍😍","5":"❤️","6":"mükemmel","7":"This company doesn't see any more money from me! For me, starve!","8":"Cute","9":"Boycotting+ blocking","10":"🇵🇸🇵🇸🇵🇸🇵🇸🇵🇸🇵🇸🇵🇸🇵🇸","11":"🇵🇸🇵🇸🇵🇸🇵🇸🇵🇸🇵🇸🇵🇸","12":"@marasimeonidou Καλησπέρα! Θα χρειαστεί να μας στείλεις σε προσωπικό μήνυμα ποιο ακριβώς φόρεμα σε ενδιαφέρει, ώστε να μπορέσουμε να σε εξυπηρετήσουμε. Παραμένουμε στη διάθεσή σου.","13":"#blockout2024 🇵🇸","14":"Nice","15":"Ich habe den schwarzen Blazer in 36 übrig :) Falls jemand Interesse hat, gerne melden. I have the black Blazer in 36 left. Message me if youre interested.","16":"@lisatpedersen Hi there! Please DM us with the country you are based in and the screenshot of the shorts and we will be able to further assist you. Speak soon!","17":"Postovani, ovo je bila posebna kolekcija koja se rasprodala u trenu i trebalo je puno srece za kupiti artikal. I nalon sto je narudzba prosla, sve bilo placeno Vi mi javljate da tog artikla nazalost nema na stanju... \nVec dugo kupujem u hm... sto mozete vidjeti i po mom korisnickom racunu. Ali posebne kolekcije su svaki put sve gore sto se tice dostupnosti artikala, nacina kupovanja... proslu kolekciju su mi 3 stvari koje sam uspjela staviti u kosaricu maknute iz nje ni pola minute nakon sto sam ih stavila, sada ovo... stvarno nije u redu od HM.a...","18":"So coool! Love it!👏👏👏","19":"🙌🙌🙌🙌🙌🙌🙌🙌","20":"Zamin","21":"#boycotthm","22":"H&M needs to offer a met gala collection","23":"👏🏼","24":"Love this🔥🔥🔥","25":"Awkwafinaaaa gorgeous","26":"#freepalestine🇵🇸❤️ #alleyesonrafah #genocide #gazaunderattack","27":"Not because the pregnant woman, dressed like that, looked horrible, dressed in such poor taste, ugly!","28":"@renedeklerk oh the gaslighting lol‼️‼️ you’re addressing her pregnancy Karen, which is clearly about her BODY‼️‼️‼️ hence you are body shaming out of your own insecurities. But I’m not surprised your ancestors were colonizers who constantly body shamed native people who were open and free about their body. Its deeply ingrained in your ignorance & need for control.","29":"@renedeklerk oh yeah? My response to your backhanded comment is also my opinion. PREGNANCY CAN BE BEAUTIFUL NAKED. Body shaming came from your ancestors so I’m not surprised a Karen like you would say that 🤡","30":"ミッキーマウスで歩いてみたいわ🎵","31":"Free Palestine 🇵🇸","32":"@casslaro i criticize and this is the point of commenting…","33":"muhteşem bir elbise","34":"😢 Why didn’t they show these outfits?! These are amazing! Had no idea","35":"Always said just wait wait wait?? Until when??????","36":"😍😍","37":"😍😍😍😍","38":"@hm merci  bonne journée","39":"👏👏👏","40":"🔥","41":"@hm for Belgium please😍","42":"Why are your woman’s trouser leg length made for someone 6’4” tall!!! All 4 pairs to be returned. Crazy tailoring","43":"hm harikası 🌼","44":"🔥🔥🔥","45":"Z,,,,,,,,, ,,,,,,,,,,,,,,, ,,,,,,,,,,,,,,,,,,,,,, all","46":"Please stop selling down. In Vietnam, ducks are stabbed in the neck, feeling the pain of the knife being driven into their throat. and their legs are cut off, for their feathers to be sold to H&M as “responsibly sourced”","47":"♥️","48":"Han den 🖤🖤🖤🖤💜💜💜💜","49":"Thanks 😍","50":"@hmmedellin Colombia","51":"Image 1:\nSwimsuit 1217609001\n\nImage 2:\nBikini top 1240239003\nBikini bottom 1223367003\n\nImage 3:\nBikini top 1240512005\nBikini bottoms 1227251016","52":"ürünler çok kaliteli","53":"DISGUSTING COMPANY!!!","54":"😎","55":"#DitchDown 🦆🪿","56":"😍","57":"Image 1:\nSwimsuit 1209690002\n\nImage 2:\nBikini top 1115638001\nBikini bottom 1217611001","58":"Mᴀsᴛ ᴍᴀʟ ʙᴀᴀ","59":"Hello,\nRespected \n\nI Recently Saw Your Profile And Am Really Impressed To See It.\n\nDear, I think We Built A Great Business Relation Together.\nI wanted to work as your manufacturing partners.\nI Introduce Myself As CEO Of Chic International.\nWe are the manufacturer and exporter of Sports Wears and Sports Goods.\nOEM and ODM orders accepted.\nIf you are interested,  i  explain you more about my company.\n\nThank you.","60":"⚡","61":"🔥🔥🔥🔥🔥🔥","62":"Devolución en H&M un desastre ! Nunca uséis el buzón de devolución porque yo no recibí mi dinero aún después de 7 días !","63":"#BoycottHM #CANCELED #NotoColonizationFunders #FreePalestine #Blockout2024 🔻🔻🔻🔻🇵🇸🇵🇸🇵🇸✌✌✌","64":"Owaaa!!!😍😍😍","65":"Hi, since morning the collection is in status bientôt disponible….(Belgium). Could you please check?? Thank you! 🙏","66":"🔥❤️","67":"😍😍😍","68":"🇧🇷❤️🔥","69":"@itschelseaj_ come to any store its available madam","70":"HM 👍..","71":"😍😍","72":"Ommmgg😍","73":"Wow so fresh🩵","74":"Where is the red maxi? It’s in the email but not on the site.","75":"Bravo ❤️🔥","76":"É no Brasil?🇧🇷","77":"Do you want to explain why I just read that you’re one of the biggest forced labor exploiters in the world??","78":"summertime summoned ❤️‍🔥","79":"So in love with that red one piece!","80":"🙌 yes","81":"@maynama du rouge encore et encore","82":"❤️❤️❤️","83":"❤️❤️❤️","84":"It's impossible, I'm a millionaire and I don't know what to do with the money.","85":"My God, how many millions of dollars do I have in my bank account, who do I send it to?","86":"Pls change your guys store changing rooms from curtains to doors. My privacy has been invaded way too many times.","87":"❤️❤️❤️❤️❤️❤️","88":"ᴀᴀᴊ ᴍᴇʀᴀ ʙɪʀᴛʜᴅᴀʏ 🎂 ʜᴀɪ ᴋᴏɪ ᴡɪꜱʜ ᴋʀᴅᴏ 😢😢😢","89":"𝒢𝒽𝒶𝓇 𝓅𝑒 𝓀𝑜𝒾 𝓃𝒾 𝒽 ☺️☺️ 𝒮𝓉𝑜𝓇𝓎 𝒟𝑒𝓀𝒽𝑜 𝒢𝓊𝓎𝓈 🥵🥵🦋","90":"I want that dress but not going to buy it after finding out your company uses forced labor \nYou lost a customer and I’m taking all my followers with me","91":"😍😍😍","92":"❤️","93":"You have no agents in chat from yesterday. Can somebody please reach out to me so that I can get a return label for my order??'","94":"😍😍😍","95":"@romassariolli exatamente!","96":"@hm just has a campaign out, with beautiful pictures taken in Brasil, soundtrack you can hear with Brasilian music, but oh the irony: HM is using cotton from areas that should be preserved ( is HM aware of the massive floodings in south Brasil right now?) This is from april 19 th. : A year-long Earthsight investigation found that fiber certified by ethical supply chain organization Better Cotton was grown on “stolen” and “deforested” land in Brazil. A year-long investigation by nonprofit Earthsight published last week found that cotton grown on what the group said is “stolen” and “deforested” land in Brazil’s Cerrado region appeared in garments approved by supply chain certifier Better Cotton and sold by retail giants H&M and Zara parent company Inditex.\nThe traced cotton is grown in the Brazilian state of Bahia by two of the country’s largest producers, SLC Agrícola and Grupo Horita, per the report, which said both companies have been fined repeatedly for environmental violations. The investigation traced the cotton to eight Asia-based clothing manufacturers that supply H&M and Inditex with “millions” of garments, per the investigation. So it is absolutely provoking that HM ignores that and still use the Brasilian florests to shoot their campaign, like they care..","97":"🖤🖤🖤","98":"Uygulama saatlerdir hata veriyor @hm","99":"@hm ⚠️⚠️⚠️Ho controllato il mio ordine e sul sito risulta come consegnato ma non l'ho ricevuto.⚠️⚠️⚠️ Nessun pacco è arrivato fino ad oggi,16\/05\/2024 alle 10:12 ⚠️⚠️⚠️ @H&M non ha risposto a nessuno dei miei messaggi.⚠️⚠️⚠️⚠️","100":"Yes,this is horrendous 💔. STOP this H&M now!","101":"STOP killing ducks so bloody brutally for their feathers!——-shame on you H&M🤬,& telling the public that they are ethically sourced!","102":"waaaooww","103":"@hannkatsu Schade, dass dir unsere aktuellen Styles nicht zusagen - Mode ist natürlich auch immer Geschmacksache. Was die Bademode angeht, so bieten wir derzeit tatsächlich nicht viele Looks an und geben dein Feedback gerne entsprechend weiter.","104":"This company doesn't see any more money from me! For me, starve!","105":"Geht euer Unternehmen pleite oder so? Ihr habt für diesen Sommer fast keine Neue Kollektion für Schwangere rausgebracht, alles nur schwarz, basic beige und gestreiftes? Nicht mal neue Bademode habt ihr. Richtig enttäuscht ihr verliert damit eine einkaufsstarke Zielgruppe. Jetzt muss ich mir woanders moderne Umstandsbikinis holen die bei anderen über 70€ kosten. Warum bringt ihr nicht die reguläre Kollektion als Umstandsmode raus? Früher hattet ihr so schöne Sachen.","106":"😍😢👏","107":"🔥🔥🔥","108":"Nice dress 😍","109":"👏","110":"Why did you discontinue the plus section in India?","111":"In Vietnam, ducks are stabbed in the neck and their legs are cut off. Their stolen feathers are then sold to H&M as “responsibly sourced” down @peta","112":"Hey y'all fancy a disabled athlete for any modelling projects?","113":"@danielagomezramos","114":"","115":"@lena_k_1124 dann Kauf es nicht und Ende!!!","116":"@shahedadollie Nein!!!","117":"Please check DM. Thank you ❤️","118":"❤️❤️❤️","119":"@lena_k_1124 Du findest bei uns auch sehr viele Looks aus Baumwolle - filter im Onlineshop einfach nach deinem Lieblingsmaterial.","120":"Polyester 👎🏻👎🏻👎🏻","121":"When l lost my job, I thought I have lost it all. With the little cash of $2.000 I got $15.000 with  she may not know it, but really she has saved my life @ashley__taylor_","122":"HM 👍..","123":"The 2nd dress 😍😍","124":"I have blocked this account!!! How dare you advertise to me!","125":"Chic❤️","126":"❤️❤️","127":"Almost everytime I place an order recently you recharge me for the order days even weeks later and then refund me back the money a day or so later \nLike the order has already been paid and received and I’m being charged for it again out of nowhere. It happens often and it makes no sense. I don’t think I’ll be ordering anymore it’s very frustrating","128":"","129":"🤷🏼‍♀️🙄🙄🙄","130":"Bouncing back stronger when it comes to finance. All thanks to you I actually made about $100,000 with an investment of $10,000. I recommend @ashley__taylor_","131":"Quem compra moda criminosa  legalizada, deveria saber que essa empresa compra algodão oriundo de grilagem de terras no Brasil, colocando em risco o bioma CERRADO  brasileiro e a vida dos nossos povos originarios. Tudo está certificado pela Better Cotton que não vê  nenhuma irregularidade.\nInformações do relatório desenvolvido pela ONG EARTHSIGHT lançado em 11\/04\/24.\n #crimesnamoda  #grilagem #desmatamento  #cerrado","132":"Why show it? It's out of stock in both colours in every side 😂","133":"I love H&M store ❤️😍","134":"Yuk, the 80s and 90s are finished, where are the fresh new designs?","135":"Genocide supporter...blocking this account.","136":"I want 1🔥🔥🔥","137":"Done block out 🔥","138":"🔥🔥🔥❤️❤️","139":"👽","140":"mükemmel","141":"This company doesn't see any more money from me! For me, starve!","142":"Cute","143":"@itsgonnabejustright wait Israel is now a regime, last time I checked was a Republic while Palestine isn't!","144":"I love the first dress but it’s sold out 😭😭😭😭","145":"@junglasuburbana oh Marina, you gullible thing you. Supporting a regime no better than Nazi Germany isn't a cute look on you. But go ahead, keep shouting 'khammass' and 'human shieldzz', put your fingers in your ears too, if that helps you sweetie 😉😘","146":"@itsgonnabejustright Just to make it clear Zara and H&M are not thr same company and they don't both take the blame just because they sell the same kind of product. Even though I have to say that Zara did anything wrong and so H&M, is not them killing kids is Hamas using them as huma shields.","147":"🔥","148":"In Vietnam, ducks are stabbed in the neck and their legs are cut off. Their stolen feathers are then sold to H&M as “responsibly sourced” down @peta","149":"Is it me or is the online customer service with HM the worst. 10 minutes asking rep to speak to a supervisor as she made up reasons for my call none of them I ever told her she refused to allow me to speak to a supervisor. I had to literally y’all at her for her to get the point. She don’t listen to a word I was saying the conversation was repetitive and dare I say down right annoying because it was as if I was talking to myself the language barriers have become to much when trying to get issues resolved","150":"Bouncing back stronger when it comes to finance. All thanks to you I actually made about $100,000 with an investment of $10,000. I recommend @ashley__taylor_","151":"Check my page","152":"Nice😍🔥👏","153":"People you need to boycott brands that still participate funding arms for Israel 220 days of genocide 🇵🇸 #blockout2024 🇵🇸","154":"🩷🩷🩷","155":"@ahh_sharon_ Hello, Sharon! We greatly appreciate your interest on checking this beautiful dress. Rest assured, we will help you locate the item and see what we can do. We're able to find the item and you may check it on the app or our website using this link https:\/\/www2.hm.com\/en_au\/productpage.1217947003.html. As of now, this item is still labeled as coming soon which means we're still about to release this item online in Australia but we currently don't have the exact date to when this will be available for purchase. However, we suggest keeping an eye on the item online using the link provided for you to be notified once it gets released and for you to place an order since this item is only exclusive for online purchase. \n\nKindly refer to the steps below to place an order successfully. \n\n1. Kindly log on to your H&M account by using our website through this link https:\/\/www2.hm.com\/en_au\/index.html. \n\n2. Add the boots to your shopping bag. \n\n3. Check all the necessary information on your H&M account(email, delivery address and billing address) \n\n4. Proceed to checkout. \n\nAfter a few minutes, you will receive an email to confirm your order. To know more about our order and deliveries, please refer to this link https:\/\/www2.hm.com\/en_au\/customer-service\/shippinganddelivery.html. Hope this helps!","156":"@hm image 2 not available in Australia?","157":"Sono una ragazza che ha appena aperto un negozio con tanto impegno e sacrifici, chiedo supporto a tutti voi ho abbigliamento e accessori all’ultima moda e di alta qualità a prezzi modici ✨✨✨","158":"@junglasuburbana why paying attention now? Not fashionable or trendy to see the genocide these big labels are contributing to? Aww 😘🇵🇸","159":"@karolgaarden Hello there! Please send us a private message or contact live customer service so we can better advise. Speak soon!","160":"","161":"@ida_egerstad Hello! Please send us a direct message so we can assist you! Take care!","162":"@sara0lofsson Hi there! Thank you for your message. We did have a global technical issue causing problem with the delivery options in checkout. We are really sorry about the inconvenience and are happy to share that the problem is now solved 😊","163":"@marcicalisto Hi there, we're sorry to hear this! Please send us a DM, then we can look into this for you. We are looking forward to your message!","164":"La línea de camisetas de moda en la capital! @underground28700 Link en BIO","165":"@snesha___ Wir bedauern deine Schilderung, doch können wir an dieser Stelle nicht viel dazu sagen. Du kannst dich gerne einmal via Direktnachricht bei uns melden und wir werfen einen Blick auf dein Konto.","166":"Hello! I am a young person who cares about protecting animals. I really admire your company, and ask you to take a stand for corporate sustainability and social responsibility. Please consider no longer selling fur or other animal materials. Conscious consumers like myself want to know that our favorite companies are committed to sustainable, eco-friendly, animal-free materials. Thank you for your time and consideration!","167":"Please respond to DM. Thank you!","168":"In love 😍","169":"Y","170":"😍😍😍","171":"🙌🙌🙌🙌🙌🙌🙌🙌🙌🙌🙌🙌","172":"","173":"@miliecl Beautiful right? Our heeled suede sandals are available in select countries. You can check availability using the product number 1217971001. Happy shopping!","174":"#blockout","175":"#blockout2024🇵🇸","176":"#blockout2024🇵🇸","177":"H&M,was ist mit eurem Service los? Seit wann seid ihr so schlecht geworden?Ich bin jahrelanger ,zufriedener Kunde und habe immer gerne und nicht wenig bei euch gekauft.In letzter Zeit passieren aber viele Fehler.entweder bekomme ich eine falsche Ware oder meine Retoure wird nicht richtig verbucht.Bis jetzt hat das aber immer über den Chat gut geklappt und man konnte mir immer helfen.Heute aber,stellte ich wieder fest dass eine Retoure falsch verbucht wurde und wandte mich an den Chat in der App und die Dame sagt mir ,da bei mir in letzter Zeit öfters was falsch verbucht worden ist,werdet ihr mir nichts mehr korrigieren weil ein Verpackungsfehler oder buchungsfehler eurer Seits ausgeschlossen werden kann.Wie dreist ist das denn bitte??!!! Ich soll für etwas zahlen was ich mir nicht behalten habe! Mir wird unterstellt es sei mein Fehler.Stellt euch mal vor ich bestelle was teures und ihr kommt mir dann so!das ist eine bodenlose Frechheit! Ich bin sauer,verärgert ,wütend,enttäuscht.Ihr habt mich definitiv als Kundin verloren ,denn so etwas habe ich noch nie wo gesehen.nicht bei zara,Mango,weekday,Stradivarius oder sonst wo.schämt euch!","178":"@hm it didn’t work! All day trying to fix it… the website is saying that my address don’t exist😂 I buy and work for you guys for years! Now I have to buy from another store, because is still not working!","179":"Ich hatte des Öfteren falsch verbuchte Retouren in der Vergangenheit. Nachdem mehrmals auf meine Nachfrage nachgeforscht wurde bekam ich eine Email, in der mir mein Recht auf Nachforschungen genommen wurde und pauschal ausgeschlossen wurde, dass weitere Korrekturen in meinem Kundenkonto vorgenommen  würden. Jetzt gab es schon wieder ein Artikel der trotz Rücksendung nicht als Retoure verbucht wurde. Die Kosten soll ich tragen mit Verweis auf die E-Mail. Laut meinem Anwalt ist dieses Verhalten nicht zulässig. Ist das noch jemandem passiert? Ich wäre dankbar über Eure Erfahrungsberichte, vor allem ist mir aber auch wichtig aufzuklären.","180":"#boycott #blockout2024  clean up time!","181":"@jarrahalqahs why H&M now? Is not fashionable to post the same under the other clothes brand?","182":"@ida_egerstad Same","183":"@hm Please fix your website and app. It has not been working for several hours, so I can't get past the delivery address.","184":"Please fix your website and app. It has not been working for several hours, so I can't get past the delivery address.","185":"@hm I have deleted the app, installed it again but that didn’t help.","186":"@hm I have done that already and i still cant get past delivery adress","187":"@karolgaarden Hi there! We're sorry for the app trouble you're experiencing and know how frustrating this can be. To help get our app running smoothly, we kindly ask that you delete the app from your device and reinstall it. This will ensure you've got our most current app software and help with shopping hiccups. Kind regards!","188":"❤️❤️❤️","189":"Orribile ogni cosa","190":"Boycotting+ blocking","191":"🇵🇸🇵🇸🇵🇸🇵🇸🇵🇸🇵🇸🇵🇸🇵🇸","192":"🇵🇸🇵🇸🇵🇸🇵🇸🇵🇸🇵🇸🇵🇸","193":"🇵🇸🇵🇸🇵🇸🇵🇸🇵🇸🇵🇸","194":"#freepalestine","195":"#freepalestine","196":"#blockout2024🇵🇸","197":"#blockout2024","198":"Beautiful collection👌🏻 I love this dress 🥰","199":"#boycott brands that support Israel in her Genocide, Israel is a terrorist illegal state #blockout2024 🇵🇸🇵🇸","200":"La línea de camisetas de moda en la capital! @underground28700 Link en BIO","201":"Proyecto cbumcoleman","202":"","203":"#dropaidintogaza 🇯🇴🇯🇴🇯🇴🇯🇴","204":"#blockout2024","205":"🇵🇸🇵🇸🍉🍉🇵🇸🍉🇵🇸🍉🇵🇸🍉🇵🇸🍉🇵🇸🍉🇵🇸🍉","206":"Boycott for Palestine 🇵🇸","207":"Catriona in this account plisss:)","208":"#boycotthm","209":"#blockout2024🇵🇸","210":"#blockout2024 🇵🇸🇵🇸🇵🇸🇵🇸🇵🇸🍉🍉✌🏻✌🏻","211":"Block","212":"🇵🇸","213":"🇵🇸🇵🇸🇵🇸🇵🇸🇵🇸","214":"All eyes on Gaza","215":"😍","216":"#blockout2024🇵🇸","217":"#blockout2024🇵🇸","218":"❤️❤️❤️❤️❤️❤️❤️❤️❤️","219":"#blockout2024","220":"#freepalestine🇵🇸","221":"#blockout","222":"Free Palestine","223":"Haaaa you are being blocked lol","224":"Blockout 👋👋🇵🇸🇵🇸","225":"#freepalestine🇵🇸 #blockout2024\n#alleyesonrafah #freecongo🇨🇩","226":"#freepalestine #boycott","227":"Block","228":"Bring back the black patent tote shopper bag 🖤","229":"#blockout2024","230":"#boycotthm","231":"","232":"Great😍","233":"😍😍😍stupendo","234":"@libre_come_ Hi there! We are sorry to hear this. For us to safely access your account and look into this for you please DM us and confirm your full name, order number, email address and complete billing address. Speak soon!","235":"#blockout2024🇵🇸","236":"It’s really difficult to get refund from its online website. I have ordered 2 trousers two week ago but I haven’t received the refund till now. The most useless customer services . Never gonna order anything from @hm","237":"🇵🇸🇵🇸🇵🇸🇵🇸🇵🇸🇵🇸🇵🇸","238":"🇵🇸🇵🇸🇵🇸🇵🇸🇵🇸🇵🇸🇵🇸🇵🇸","239":"🍉🍉🍉","240":"@marasimeonidou Καλησπέρα! Θα χρειαστεί να μας στείλεις σε προσωπικό μήνυμα ποιο ακριβώς φόρεμα σε ενδιαφέρει, ώστε να μπορέσουμε να σε εξυπηρετήσουμε. Παραμένουμε στη διάθεσή σου.","241":"#blockout2024 🇵🇸","242":"Nice","243":"Καλησπέρα,  ποιος είναι ο κωδικός του φορέματος για να το παραγγείλω?","244":"@marietta__jan This blazer is truly one of our absolute favorites! To see if it's available in your area, please enter product number 1223815002 into our search engine. Happy shopping!","245":"what’s the article of blazer?","246":"Boycott for Palestine 🇵🇸","247":"#blockout2024 #blockout2024🇵🇸 #blockout","248":"🇵🇸🇵🇸🇵🇸🇵🇸🇵🇸🇵🇸","249":"🇵🇸🇵🇸🇵🇸","250":"Wow","251":"Wow😍","252":"#chop #freepalestine #boycott #bye 🇵🇸🇵🇸🇵🇸","253":"","254":"#blockout2024","255":"#blockout","256":"your silence will be remembered.","257":"Blocked for being silent\/complicit for the genocide in Gaza. Shame.","258":"Beautiful 😻","259":"","260":"🔥🔥🔥","261":"Sold out in few minutes. Waste of time.","262":"😍😍😍😍","263":"Love it! 🔥","264":"@misspinkyorange Es freut uns zu lesen, dass dir die Kollektion so gut gefällt. Da wir die Items nur in geringer Stückzahl anbieten, kann es sehr schnell passieren, dass sie ausverkauft sind, das tut uns natürlich leid.","265":"#freepalestine","266":"#blockout #blockout2024 #blockinfluencers #blockcelebrities #blocknonintersectionalhealers #blocknonintersectionalfeminists #blocknonintersecrionalallys #alleyesonrafah #freepalestine #capitolvsdistricts","267":"🔥🔥🔥🔥🔥🔥","268":"😍😍","269":"Die neue Kollektion ist der Wahnsinn 😍 enttäuscht bin ich dennoch 》 den ganzen Vormittag gewartet bis es endlich online ist 》 zack in 5 min alles ausverkauft! 😢 habt ihr sooooo wenig von der Ware oder ist die Kollektion nur für VIPs? 🫤","270":"🇵🇸🇵🇸🇵🇸","271":"#freepalestine🇵🇸","272":"The flyest! Big dawg @lordkez🔥🚀","273":"💥","274":"Owaaa!!!😍😍😍","275":"YES @lordkez 🐥❤️","276":"😍🔥🔥 Stunning!","277":"Ugh 😍","278":"Hello , I need my money back , where is the customer service ????? You just keep my money now ?","279":"3rd slide. I'm in love with the dress 😍  the code, please 🙏🏾","280":"@lordkez ate","281":"What is the product code for the dress in the first slide of the carousel please? Thanks Liz","282":"Beautiful 😻 🇿🇦","283":"Wasted two days waiting for the launch on 2 different countries. Will ignore H&M next time. They clear don't care about the general public","284":"A curated queen @lordkez 🔥","285":"#freepalestine ✊🏼","286":"Ahhhhhh @lordkez u look so good 🥺‼️","287":"So nice🌈💫","288":"🔥🔥🔥","289":"#blockout2024 🇵🇸🇵🇸🇵🇸","290":"Ich habe den schwarzen Blazer in 36 übrig :) Falls jemand Interesse hat, gerne melden. I have the black Blazer in 36 left. Message me if youre interested.","291":"@lisatpedersen Hi there! Please DM us with the country you are based in and the screenshot of the shorts and we will be able to further assist you. Speak soon!","292":"Postovani, ovo je bila posebna kolekcija koja se rasprodala u trenu i trebalo je puno srece za kupiti artikal. I nalon sto je narudzba prosla, sve bilo placeno Vi mi javljate da tog artikla nazalost nema na stanju... \nVec dugo kupujem u hm... sto mozete vidjeti i po mom korisnickom racunu. Ali posebne kolekcije su svaki put sve gore sto se tice dostupnosti artikala, nacina kupovanja... proslu kolekciju su mi 3 stvari koje sam uspjela staviti u kosaricu maknute iz nje ni pola minute nakon sto sam ih stavila, sada ovo... stvarno nije u redu od HM.a...","293":"Do you have a product nr on the beige shorts from this collection? I know its sold out but I want to see If it comes back Stock. Thanks 😍","294":"@__jades__ also why they want to charge for a bag for 10 cents when we go shopping at the mall","295":"@shvindt_u Oh no! We're sorry to hear your order was cancelled. Please DM us with your query, so that we can take a further look into this for you. Hope to hear from you soon!","296":"Exactly. That’s why I shop at Zara because they wouldn’t pull this bs.","297":"Looking for the orange dress in M","298":"@imjodn as usual... 🤦🏻‍♀️🤦🏻‍♀️🤦🏻‍♀️🤦🏻‍♀️🤦🏻‍♀️🤦🏻‍♀️🤦🏻‍♀️","299":"👏👏👏👏👏👏","300":"@enliess 👏👏👏👏👏","301":"😍😍😍😍","302":"🔥🔥🔥🔥🔥","303":"🇵🇸🇵🇸🇵🇸","304":"RESTOCK THE BAAAAAGG","305":"","306":"Well said","307":"🔥🔥🔥🔥🔥","308":"चुत्या😂","309":"❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️","310":"مين الكائن دا","311":"Это де из этой игры где ты убегаеш от кого то с тунеля","312":"Youse want to also work on being able to handle your fulfilment and SLO’s… even if you do get to purchase anything your waiting way over the estimated time frame.","313":"Should drop 10th in Germany, waiting whole night! morning..evening.. AND NOW ALL SOLD OUT ?!?! ARE YOU KIDDING ????","314":"One minute after 10 A.M in Germany  you could buy the collection  2 Minutea after it was nearly all sold out. My favoourite the silk scarf disappeared and that was it. I only could buy the collier. Or you must buy one after one. 😢😮","315":"Super disappointed I was waiting all  morning may 9 and when I check everything was sold out . Do better hm loyal customers missed out on","316":"Da igual, es feisimo","317":"Wasted two days waiting for the launch on 2 different countries. Will ignore H&M next time. They clear don’t care about the general public","318":"Super cute swimsuit 🩱","319":"Daaame 🔥❤️","320":"Totally agree 👍🏻","321":"😂","322":"#blockout2024","323":"Could we get H&M X nicki Minaj? 👀","324":"I have a puffer jacket from H&M I got myself while on my adventure in W\/S I have it still I hope","325":"@hm you’ve got all the details already. I’m asking you to investigate my parcel since yesterday.","326":"Delivery service in the UK is shocking!!","327":"@virginiamoonrose Hi there! We are sorry to hear this. Please DM us your full name, order number and home address to safely access your account. Talk soon.","328":"The bag is exactly my expression now","329":"Tout est vendu 😩","330":"😍😍😍","331":"I completely agree , @hm keeps ignoring my comment, they allow influencers in each country to have first preference for everything than for the general public nothing is available, it is really unfair... Why even bother to sell to us in the first place when all they care about are influencers, if an influencer posted this comment they would respond In an instance and probably get free items...","332":"When will leopard ballet flats be in stock??","333":"Why not just make more of it so more people can buy it? It’s immediately sold out.","334":"😍","335":"🔥🔥🔥🔥🔥🔥","336":"OmG she looks like Linda Womack, now known as Zeriiya Zekkariyas","337":"@mayola_ay77 Hola, lamentamos escuchar que tienes un problema con la app. Por favor envíanos un mensaje directo con tu correo y nombre para que podamos apoyarte con este asunto. Quedamos atentos.","338":"Can’t believe it! It’s @parco.dei.mostri the magic park in Bomarzo near Rome! I visited it last year, can’t wait to come back 😍🧌🇮🇹🍝🇮🇹🍕🏛️","339":"Do we receive these in New Zealand?","340":"So coool! Love it!👏👏👏","341":"🙌🙌🙌🙌🙌🙌🙌🙌","342":"Zamin","343":"AKUU INGIN JD KARYAWAN MU","344":"Hnm your not cool anymore . You have sod out and finance death and murder . Get a grip!","345":"funding a massacre","346":"❤️❤️❤️❤️❤️❤️","347":"🔥","348":"HORRIBLE COMPANY- was late by 2 days for their return policy bc it’s by the date you ORDER not by delivered date like every other company. MY DOG WAS DYING OF BRAIN CANCER AND I COULD NOT DRIVE THE 30 miles to the store. Promised me refund and then issued me store credit","349":"Greetings! I am a young person who cares about protecting animals. I respectfully ask you to stop selling down in your stores. Many warm, animal-free materials are available today, including vegan down made from flowers, ceiba tree fiber, bamboo, or milkweed as well as Plumtech, Thinsulate, and PrimaLoft.\n\n \nThank you for your compassion for animals.","350":"Owaaa!!!🔥🔥🔥","351":"#boycotthm #savepalestine #alleyesonrafah","352":"Beautiful","353":"❤️","354":"🙌","355":"No act of kindness no matter how small it is,is ever wasted.The dogs are out of food and they need medication.Please reach out to us.We don't need to have deep pockets or be rich to donate","356":"Can you respond to your dm, I need my order delivered today","357":"❤️❤️❤️","358":"#boycotthm","359":"H&M needs to offer a met gala collection","360":"👏🏼","361":"#blockout #blockout2024 #blockcelebrities #blockcelebrities2024 #alleyesonrafah #freepalestine #capitolvsdistricts","362":"❤️❤️❤️","363":"@juliettebtlr","364":"Let’s also acknowledge the extraordinary jewellery design by @dicksondesigns, shall we?! 🙌🌸","365":"@anastasiaknyseva finden wir auch!","366":"👎🏻","367":"She is so beautiful 😍","368":"Sehr schön.😍😍😍👏👏👏","369":"🙌","370":"❤️❤️❤️","371":"😍😍😍","372":"Special 😍","373":"🔥","374":"@hm 📞","375":"So beautiful 🔥👏👏","376":"❤️❤️❤️❤️❤️❤️","377":"@missus_peel Hi there! We are sorry to hear you have not received your order. We appreciate this will be disappointing. Please note you can DM us here or on Twitter or call us on 03 44 736 9000, we also have a live chat team on our website. For us to take a further look, please DM us your full name and email to safely access your account. Talk soon.","378":"HM you never miss","379":"@15dumebi_ ❤️","380":"Can you check your dm please","381":"😍😍😍","382":"😍","383":"What if you make medical scrubs ? 😍","384":"🔥","385":"Riktig prinsessa! 👸❤️","386":"Love this🔥🔥🔥","387":"Awkwafinaaaa gorgeous","388":"#freepalestine🇵🇸❤️ #alleyesonrafah #genocide #gazaunderattack","389":"😍😍 Çok güzel","390":"My dream dresscode 😍","391":"🤍🤍🤍","392":"👏🏽👏🏽👏🏽👏🏽","393":"😍😍😍","394":"❤️❤️❤️","395":"❤️❤️❤️❤️❤️❤️❤️❤️","396":"🔥","397":"@mayola_ay77  Hola, lamentamos escuchar que tienes un problema con la app. Por favor envíanos un mensaje directo para que podamos apoyarte con este asunto. Quedamos atentos.","398":"☺","399":"🔥🔥🔥","400":"😍😍😍","401":"Beautiful 😍😍","402":"https:\/\/www.instagram.com\/p\/C6om_eJt4SN\/?igsh=ZHE0bjBmdG5uaGZq\nLike fotos pls dhe sugjerojua miqve🧡","403":"Mirip  memong @tasyafarasya ❤️","404":"The first dress is beautiful with bow 😍😍","405":"😍😍","406":"Beautiful dress😍😍","407":"wooooooow😍","408":"Beautiful!!!😍😍😍😍😍","409":"Boycott Boycott","410":"HM 👍..","411":"Qué pasó con la App en Mexico ??, tiene una semana sin funcionar 😓","412":"😍👏👏😍","413":"😍😍😍😍","414":"💸💸","415":"Really want them for my bridesmaids boxes 🥲","416":"H&M when are yall gonna restock y’all’s pjs?!??","417":"3 kere kartımda para çekildi sipariş oluşmadı !!","418":"❤️","419":"😍","420":"KISSS","421":"@hanwilko86","422":"#freepalestine #stopthegenocide #ALLEYESONRAFAH","423":"Love it","424":"Enough Met now —","425":"❤️","426":"Ethereal ✨","427":"🙌","428":"Que horror🙌","429":"Peace ☮️","430":"Love ❤️","431":"Wow! Beautiful dresses 😍","432":"Not because the pregnant woman, dressed like that, looked horrible, dressed in such poor taste, ugly!","433":"@renedeklerk oh the gaslighting lol‼️‼️ you’re addressing her pregnancy Karen, which is clearly about her BODY‼️‼️‼️ hence you are body shaming out of your own insecurities. But I’m not surprised your ancestors were colonizers who constantly body shamed native people who were open and free about their body. Its deeply ingrained in your ignorance & need for control.","434":"@renedeklerk oh yeah? My response to your backhanded comment is also my opinion. PREGNANCY CAN BE BEAUTIFUL NAKED. Body shaming came from your ancestors so I’m not surprised a Karen like you would say that 🤡","435":"@ohawaiki_  read my post properly wasn’t hating on anyone - was just not loving the fashion statement!","436":"@ohawaiki_ on the contrary I wasn’t body shaming anyone was saying the fashion didn’t meet the beauty of pregnancy in my opinion. When last time I checked I’m allowed to have one!","437":"@elnino_kids_fashion exactly. Women be the biggest haters.","438":"@renedeklerk yeah stop body shaming it’s giving insecure & jealous & judgmental","439":"N🔥🔥🔥","440":"I dont usually like ladies showing prenancy belly but this, I love it!!! A McQueen vibes. HM❤️","441":"Albanski Outfit","442":"This MURDEROUS Columbus Ohio family tried  killing a child! And through racketeering and blue collared crime with street thugs, have been trying to kill a child. #MurderousAbortion #FALSIFIEDRAPE\nBecause \n[Oliver Darwin Evans], 123 Red Haven CT. Pataskala, Ohio works at CMHA 1407 Cleveland Ave, Columbus, OH 43211. Oliver Evans (614)813-5810 is a MURDEROUS Crip Drug dealer causing poverty&Domestic Terrorism (PROCEED CAUTIOUSLY)👎","443":"No","444":"If you have never been pregnant before don't comment negatively...some of us walked completely naked lol. #mum x","445":"😍😍😍😍😍","446":"🔥","447":"#blt","448":"@lotteotsen_ kan je me een dm sturen over Mitchel jumper","449":"Go to the gym please","450":"@elnino_kids_fashion  I don’t think looking like a clown with a frilly Bib and belly is classy. But each to their own","451":"My opinion I don't think it's very classy to each his own","452":"@elnino_kids_fashion womp womp","453":"@renedeklerk you can't dictate how someone chooses to show off their pregnancy. And what exactly is your definition of class?","454":"Gorgeous 😍","455":"She don't looks like happy 😢","456":"HM gcc code: T710🔥","457":"❤️","458":"❤️❤️❤️❤️❤️❤️❤️❤️","459":"Avec un sourire serait mieux","460":"👏👏👏","461":"❤️","462":"Sorry not my vibe - pregnancy is such a beautiful part of life.  Doesn’t mean it had to be in your face but it can be beautifully celebrated with class. As for the half lipstick vibe what is that!","463":"♥️♥️♥️","464":"❤️","465":"❤️❤️❤️❤️❤️","466":"Nooo","467":"❤️🙌","468":"❤️❤️❤️❤️","469":"All the love in the world @hm","470":"❤️❤️","471":"😍😍","472":"😏","473":"@isabellebeentjes kan je me een dm sturen heb een vraag","474":"@bjpascual u ateeee📸","475":"❤","476":"Gorgeous ❤️❤️❤️❤️❤️","477":"Dm","478":"Dm","479":"Dm","480":"Yuk","481":"🙌🙌🙌🙌","482":"ミッキーマウスで歩いてみたいわ🎵","483":"Free Palestine 🇵🇸","484":"@casslaro i criticize and this is the point of commenting…","485":"@joelthangsing Hey do you need help hon?  Or are you only 15 and haven’t quite worked it out yet?","486":"Free EVERYONE.","487":"Well done 🙌👏","488":"@casslaro criticism\/feedback, its literally a company account 😭","489":"wow congrats for bringing fast fashion to the red carpet 😑","490":"@mery_yooma and you say this with your eyes on H&M ‘s instagram","491":"Why do you waste your time watching others on internet instead of actually helping the people in Palestine??","492":"Disappointed Quannah Rose was even at the Met Gala. I thought she would have had more morals than the rest to be at such a capitol style event whilst in an active genocide. Slay though girl ….. smh","493":"@timpostedthat rude comment for no good reason","494":"This is a place where you can be silly n wear silly clothes and pretend to be someone important","495":"idk, i’d never buy a gown from h&m","496":"Brother ewwwww","497":"@alessio.brunello 😂😂😂","498":"@casslaro an honest comment","499":"free palestine","500":"CAN'T USEE the capitol is celebrating 🎉 the Palestine (district 12) is suffering  welcome to the 76 annual hunger games 🍉 Palestine will be free 🍉🍉","501":"ALL EYES ON RAFAH AND CANCEL HOLLYWOOD ❌✖️❌✖️❌✖️❌✖️","502":"no wonder they are ugly ash","503":"@sissou.sassou Free Palpatine","504":"@davevannie I care!!!","505":"No tx","506":"@meriembensalah2123 Free Palpatine","507":"@hayre_samia Free Palpatine","508":"@fatemehkbri Free Palpatine","509":"@heenybutt Free Palpatine","510":"Hope you all fun..while kids were being bombed and killed. You must be very proud of yourselves","511":"@eleni_officialpage we don't care about the met gala w care about Palestine 🇵🇸🇵🇸🇵🇸🗣️🗣️🗣️🗣️*how about now?*","512":"Go to hell @hm 🔥","513":"@eleni_officialpage  we don't care about the met gala w care about Palestine 🇵🇸🇵🇸🇵🇸","514":"How on earth do they manage in the ladies rest room.","515":"👏👏👏","516":"Well, a lot of us don’t care about Palestine , ig it’s mutual 🤣","517":"@kivvyboo  we don't care about the met gala w care about Palestine 🇵🇸🇵🇸🇵🇸","518":"I said what I said. Don’t cry to people about something Palestine started. Reep what you sow.","519":"Probably should concentrate on your court case!!!","520":"@kivvyboo  we don't care about the met gala w care about Palestine 🇵🇸🇵🇸🇵🇸","521":"Gorgeous","522":"Let’s cry about Palestine when you can’t finish a war y’all started 🤣","523":"Free the hostages","524":"i care","525":"@sundeityapollo","526":"Stunning 😍😍😍😍","527":"😂😂😂 Free Isreal  from murdering amass and there supporters","528":"@joelthangsing 👆🏽👆🏽ok - whoever you are … you need to take a break … because your post is out of order and unnecessary.  You need to learn to scroll on and not make comments like that - we are ashamed 👉🏼 of  you.  Get some help. 🧿🙏","529":"@alessio.brunello  both stop -  we don’t need to see hissy fits or bitching.  Stop guys","530":"@larsbodo87 don’t be nasty - no need.","531":"No","532":"muhteşem bir elbise","533":"😢 Why didn’t they show these outfits?! These are amazing! Had no idea","534":"Always said just wait wait wait?? Until when??????","535":"😢that I know ofHM 🥺🥺","536":"Stunning!!!!!!","537":"Love that we are now marking all ages AND colors 👏","538":"😍😍","539":"❤️❤️","540":"❤️","541":"ANN-SOFIE!! 🔥🔥🔥","542":"@lafilomena_mimbre ¡A nosotros también nos encanta!","543":"Vamos hacértelo","544":"El rojo es lo más, zapatos, vestido, maquillaje, peinado!!!! La pera 😍😍😍","545":"😢👎🏼","546":"Que feo los vestidos 👗","547":"Looking smashing @Ann-SofieJohansson 👏","548":"🔥🔥🔥🔥","549":"Quannah is stunning 🤩","550":"🔥👏🙌","551":"Ann-Sofie looking stylish as hell! As usual 👏👏❤️❤️","552":"🙌🙌🙌","553":"👏👏👏","554":"🔥🔥","555":"ALL EYES ON RAFAH ✊🏼🇵🇸🍉","556":"When will they be available in your stores for us mortals🙌","557":"🩵🩵🩵 loved creating quannahs accessories to match her beautiful gown😊","558":"😍😍😍😍","559":"STUNNNINGGGGG","560":"Yes👏🏾👏🏾","561":"Who is the talented photographer who shot all these photos?","562":"#stopthegenocide #palestinianchildrenmatter #ALLEYESONRAFAH #freepalestine","563":"😍😍","564":"😍😍😍😍","565":"😍😍","566":"Yahooooooo❤️🔥❤️🔥❤️🔥❤️❤️❤️❤️❤️❤️❤️","567":"The colour is exquisite.","568":"How do I get into the H&M couture design team? ✍️","569":"🙌🙌🙌","570":"Damnnn the first one is sooooooo good one of best outfits in met Gala 😭💜💜💜💜","571":"All pieces are beautiful.","572":"😍😍😍","573":"UGH! SO BORING!!!","574":"Well done H&M. Lovely designs and remembering to include also a mature person. Next time, the display will be even stronger if you avoid the stereotyping pitfall of dressing the mature person in dark styles covering her body and concealing figure. I look forward to that 🖤🫶🏼","575":"🙌","576":"👏","577":"😍😍😍😍","578":"🔥🔥😍😍","579":"❤️❤️❤️❤️❤️❤️❤️","580":"2nd and 5th slide gowns are gorgeous 👏👏👏","581":"Wow never would I have thought these are h&m outfits! Love them!","582":"😍😍","583":"😍😍😍😍","584":"@hm merci  bonne journée","585":"I like the teeth 😍","586":"What time today will it be available?","587":"@karlsson_yvonne Hi! This lovely collection will launch very soon. We recommend you to keep an eye on our website. Have a great day!","588":"Dm","589":"Dm","590":"Dm","591":"When can I order the necklace in Sweden? 😍","592":"👏👏👏👏","593":"@chetanareddy_ Hi there!\nWe haven't heard anything from you, hope that your concern has been resolved. \nHowever, you can get back to us if you have any concerns.\nThank you for choosing H&M. Have a wonderful day ahead.","594":"Free Palestine 🍉🍉","595":"Peggior servizio clienti di sempre","596":"@tamikam13 Hello there! We hope the issue got sorted out and you were able to avail the discount! The app does seem to be working currently but if you were unable to avail the members' discount, please do send us a private message and we will see what we can do. Speak soon!","597":"Did you licence the images of the Monster Park you used?","598":"😍😍","599":"Hi @sanne.and.the.city. I confirm you that the launch will be at 10 am. \nHave a nice day! 😀","600":"@hm really disappointed I’ve been wanting to checkout on items in my basket for members day discount and you have been updating the site which means you can’t even get to use the discount as it’s away to end!!!!","601":"@natalia_kramer_ Hey there! We're so excited to share these style with our fashion friends! The H&M Studio Resort Capsule launches May 9th - stay tuned! We can't wait till this suit is yours! 😀","602":"How do I buy this suit?","603":"I’m so in love with this collection! At what time is it coming online at May 10th in Belgium?","604":"Nagarjuna","605":"❤️","606":"My family and I are writing to ask that you please stop using down in any of the products. Birds have feathers ripped from them while alive, after spending their whole life cramped in cages in dirty, scary, miserable conditions. Please stop using animals for your clothing. ￼￼","607":"In Italia quando sarà disponibile,? Grazie","608":"@hm stop murdering animals, you’re not worth it","609":"Down comes from hell. Pleas H&M, ditch down.","610":"Shame to them and the ones who patronize","611":"@bluepersian2944 this is animal cruelty and they should face the law","612":"🔥","613":"Ducks need their feathers. Your company doesn’t. Please stop using down in favour of the many warm, humane, eco-friendly down-free materials available today.","614":"This whole fit! 🔥","615":"❤️","616":"STOP ABUSING ANIMALSS","617":"En colombia 🇨🇴","618":"@ninabuddenhair Hello. If you would like to send us a private message with your details we will be happy to help. Speak soon!","619":"You should really not send stuff by Evri!!! Been at home all day waiting for delivery and now received sorry we missed you-they never came or rang the doorbell and I paid next day delivery. Fuming!!!!","620":"Big shame !!! Stop torturing ducks of Vietnam !!!","621":"","622":"🔥🔥","623":"🔥🔥","624":"🔥🔥","625":"🔥🔥","626":"🔥🔥","627":"🔥🔥","628":"❤️❤️","629":"🔥🔥","630":"❤️❤️","631":"🔥🔥","632":"👏👏👏","633":"🔥","634":"@hm for Belgium please😍","635":"@sanne.and.the.city Hello! We would be happy to help you check availability. For this, please confirm what country you are shopping in. Talk soon!","636":"When will the cute little golden bag be available? It’s still shows: available soon but the drop was at 10am?","637":"@rhiannonstanger Hi there! This launched this morning! Have a great day!","638":"What time will this drop on the UK website?","639":"I beg you to cease using DOWN in your products. Google and see for yourself that these poor animals endure, and for what?!💔💔💔💔","640":"@spabreaks","641":"@sematugceakar This Thursday from Sandton City or online from Superbalist 🙂","642":"@friseurhamburg ja - eine tolle Frisur!","643":"Stop using and exploiting pure souls ( animals)","644":"Ima need that bag!!! 😍😍😍","645":"Endlich schöne Locken!🔥","646":"@hm hello will this collection be available in bahrain ?🇧🇭","647":"🔥🔥🔥🔥","648":"🔥🔥","649":"❤️","650":"🔥🔥","651":"🔥🔥","652":"It’s 2024 - time to stop using animals for fashion! Ditch the cruelty!  Transition away from birds being subjected to unfathomable excruciating pain and sufferings- they don’t derserve to be treated so barbarically for fashion items!","653":"@miaitalia08 Hello Miaitalia! We really appreciate your interest in our H&M Studio Resort Capsule. We understand you would like to know if this special collection is avaialble in Australia. Rest assured, we'll do our best to help.\n\nWe're happy to share that this special collection will indeed be available in Australia starting May 9th. For more details about the H&M Studio Resort Capsule, you can visit the following link:  https:\/\/www2.hm.com\/en_au\/free-form-campaigns\/hm-studio-resort-capsule.html#\/index\/view. Stay tuned for updates!","654":"@hm and when are you gonna stop using feathers🪶??? #StopAnimalCruelty!!!🚫","655":"@_.arrrianna._  You needed this purse for prom!! #3","656":"🔥😍","657":"❤️🖤❤️🖤❤️🖤","658":"Petition from PETA secure.peta.org.uk\/page\/115994\/action\/1\n2 apocrypha on the Internet where Jesus was animalist: Gospel of the 12 and Essene gospel. Christ already returned: inricristo.org.br. Another link urbanoutraged.com","659":"Boycott @tra.velhal ❗️❌","660":"@hm Is this Dress on page 2 only in the USA and not Australia as I can not find it?","661":"In Vietnam, ducks are killed for their feathers in a terrible and inhumane way! Stop doing this to poor birds and respect the nature! This is animal cruelty in its purest form, masked as \"responsible\"  down sourcing! There is nothing responsible about it!","662":"STOP the CRUELTY","663":"Burn in HELL H&M","664":"In Vietnam, ducks are stabbed in the neck and their legs are cut off. Their stolen feathers are then sold to H&M as “responsibly sourced” down. Each bird will have felt the pain of the knife being driven into their throat.","665":"Please end your use of down feathers in favour of humane, eco-friendly, animal-free materials.  In 2024 can we please stop supporting animal cruelty.  Thank you.","666":"Please spare ducks a lifetime of suffering and a violent death by ending your use of down feathers without delay.","667":"There’s simply no excuse to keep selling down products. Many warm, animal-free materials are available today, including vegan down made from flowers, ceiba tree fiber, bamboo, or milkweed as well as Plumtech, Thinsulate, and PrimaLoft.","668":"In Vietnam, ducks are stabbed in the neck and their legs are cut off. Their stolen feathers are then sold to H&M as “responsibly sourced” down. Each bird will have felt the pain of the knife being driven into their throat.","669":"🖤🖤🖤🖤🖤🖤🫶","670":"When does this drop in South Africa?!","671":"NEED😍😍😍","672":"In Vietnam, ducks are stabbed in the neck and their legs are cut off. Their stolen feathers are then sold to H&M as “responsibly sourced” down. Each bird will have felt the pain of the knife being driven into their throat.\n\nI am urging you to ditch down.","673":"❤️❤️❤️❤️","674":"As H&M is holding its annual meeting of shareholders, it's time to address the cruelty behind down. I urge H&M to ditch down and embrace cruelty-free alternatives. Let's make fashion compassionate for all beings.","675":"Please, please, please help put an end to the abuse of ducks and stop profiting from their suffering! No animal deserves to be tortured.","676":"C'è anche a padova😮","677":"Stop now HM","678":"😍😍😍😍","679":"Please end your support of stabbing ducks in their neck and making their final experience of life excruciatingly agonising. The pain and terror these animals suffer when their legs are cut off is beyond comprehension.  They have no morphine whatsoever. Duck feathers are ripped out of them and this whole process is not “responsibly sourced” down that you market to customers on @hm products.  Each bird will have felt the pain of the knife being driven into their throat. If you have eyes and ears, open them. Customers do not want these animals to suffer the way that they do. People do not deserve to be lied to and told the feathers (down) are responsibly sourced when they are not. Please make emotionally intelligent decisions and have greater awareness of the cruelty you are dealing with.  Customers will respect you more for buying Plantbased materials. Plant materials are good to work with and prevent the physical torture of stabbing duck necks and cutting off their legs when they are alive. Please do not commit to this toxic down industry which is far from transparent.  H&M is time to be responsible and aware of what customers want.  Plantbased cruelty-free, sustainable materials please.  This is the future. The future is NOW. #saynotodown","680":"❤️","681":"Ducks are stabbed in the neck and their legs are cut off. Stop selling that cruelty products!😭","682":"Why are your woman’s trouser leg length made for someone 6’4” tall!!! All 4 pairs to be returned. Crazy tailoring","683":"hm harikası 🌼","684":"🔥🔥🔥","685":"Hello, thank you for contacting us. To find out the locations of our stores please click on the below link:\nhttps:\/\/locations.alshaya.com\/h-m\/eg","686":"🔥🔥🔥🔥","687":"@hm I know very well where the branches is but unfortunately branches in Egypt is almost empty nothing new for ages","688":"Just have to say your new return policy is AWFUL. NEVER want to shop here again","689":"@nancy.atta12 ❤️","690":"Boycott @HM until they become an ethical - cruelty free company !","691":"Petition from PETA secure.peta.org.uk\/page\/115994\/action\/1\n2 apocrypha on the Internet where Jesus was animalist: Gospel of the 12 and Essene gospel. Christ already returned: inricristo.org.br. Another link urbanoutraged.com","692":"Boycott @hm ❗️❌","693":"😍😍😍","694":"👏😍 پرفکت","695":"@ali_mohammmm Hallo, Welkom bij H&M. Kun je je vraag stellen?","696":"Pantolona bayıldım👏","697":"Hope ALL H&M burns in hell","698":"well that figures.","699":"stop killing innocent beings for no reason... there are plenty of alternatives!!!!","700":"In Vietnam, ducks are stabbed in the neck and their legs are cut off. Their stolen feathers are then sold to H&M as “responsibly sourced” down. Each bird will have felt the pain of the knife being driven into their throat.","701":"Why HM still using feathers from birds that are tortured alive to put on clothes!","702":"Please end your support of stabbing ducks in their neck and making their final experience of life excruciatingly agonising. The pain and terror these animals suffer when their legs are cut off is beyond comprehension.  They have no morphine whatsoever. Duck feathers are ripped out of them and this whole process is not “responsibly sourced” down that you market to customers on @hm products.  Each bird will have felt the pain of the knife being driven into their throat. If you have eyes and ears, open them. Customers do not want these animals to suffer the way that they do. People do not deserve to be lied to and told the feathers (down) are responsibly sourced when they are not. Please make emotionally intelligent decisions and have greater awareness of the cruelty you are dealing with.  Customers will respect you more for buying Plantbased materials. Plant materials are good to work with and prevent the physical torture of stabbing duck necks and cutting off their legs when they are alive. Please do not commit to this toxic down industry which is far from transparent.  H&M is time to be responsible and aware of what customers want.  Plantbased cruelty-free, sustainable materials please.  This is the future. The future is NOW. #saynotodown","703":"stop selling feathers! stop animal abuse!😭","704":"Ducks are stabbed in the neck, and their feet are cut off. Their feathers are then sold to H&M as “responsibly sourced” down. @hmunitedkingdom, turn over a new leaf on the day of your AGM and ditch down! #HMDitchDown  https:\/\/t.co\/LAcLZVJ4U3","705":"Ducks are stabbed in the neck, and their feet are cut off. Their feathers are then sold to H&M as “responsibly sourced” down. @hmunitedkingdom, turn over a new leaf on the day of your AGM and ditch down! #HMDitchDown  https:\/\/t.co\/LAcLZVJ4U3","706":"@donnatere Codice Top 1228390001 !","707":"Ducks are stabbed in the neck, and their feet are cut off. Their feathers are then sold to H&M as “responsibly sourced” down. @hm, turn over a new leaf on the day of your AGM and ditch down! #HMDitchDown  https:\/\/t.co\/LAcLZVJ4U3","708":"In picture 1 will the bag be sold in canada","709":"In Vietnam, ducks are stabbed in the neck and their legs are cut off. Their stolen feathers are then sold to H&M as “responsibly sourced” down. Each bird will have felt the pain of the knife being driven into their throat.","710":"In Vietnam, ducks are stabbed in the neck and their legs are cut off. Their stolen feathers are then sold to H&M as “responsibly sourced” down. Each bird will have felt the pain of the knife being driven into their throat!","711":"🔥🔥🔥","712":"Love it 😍😍😍","713":"🦋🪻","714":"❤️❤️❤️","715":"😍","716":"❤️","717":"She seems so sad 😞","718":"❤️","719":"😍","720":"😍😍😍","721":"@hm Hi! Could I get please a number of bag from 3d image?","722":"Arrêter la maltraitance sur les animaux ! En 2024 des solutions existent pour fabriquer des vêtements sans souffrance ! 💔","723":"@michelletoki Hi there! The number (1211667005) is correct but it is possible the item may be unavailable or out of stock at the moment, depending on the country you are shopping in. You can continue to search by this number in case it is available in time for summer!","724":"1211667005 doesn’t come up in the app in the UK","725":"😍","726":"Ma in Italia non è possibile acquistare","727":"@h&m stop the cruelty, ditch using down 😢","728":"Stop using feathers H&M. We don't need to do that now. I love your products but I urge you to ditch the down.","729":"My items were never delivered","730":"Stop using feathers in your products. Birds plucked alive, it’s 2024 and these barbaric acts are not acceptable. No place for this in modern society","731":"Ma perché prendete queste modelle così bruttine e tristi???!","732":"Z,,,,,,,,, ,,,,,,,,,,,,,,, ,,,,,,,,,,,,,,,,,,,,,, all","733":"Please stop selling down. In Vietnam, ducks are stabbed in the neck, feeling the pain of the knife being driven into their throat. and their legs are cut off, for their feathers to be sold to H&M as “responsibly sourced”","734":"♥️","735":"Boycotting until you become an ethical cruelty free brand","736":"Making birds suffer excruciatingly painful torturous unfathomable torment, fear and terror for  feather & down is barbaric and cruel! Making $$$ from others pain is sickening. Greed for $ at the expense of others sufferings is heinous! Ditch down","737":"❤️","738":"Pls stop that animal cruelty and stop selling feathers from abused ducks😭😭😭😭😭😭😭😭😭","739":"Making animals suffer since 1947!!!! #DitchTheDown","740":"@cusco.vintage, como cliente cliente Membro tem ao seu dispor inúmeras vantagens, sendo o envio gratuito a partir de 30€ de compras. Poderá ver todas as vantagens aqui: https:\/\/hm.info\/61784NKZj! Votos de boas compras e ótimo dia!","741":"Please, if you can, bring back the Rolling Stones red lips T-shirt. I need it!","742":"Tutto molto bello, ma ci spiegate perché non rifornite da mesi il reparto jeans uomo? Ci sono almeno 3 modelli basic, ma con prezzi diversi(dai 29 ai 39 €) che nel colore blu denim  scuro, non vengono riforniti dall’estate dell’anno scorso!","743":"Very nice😍","744":"🇵🇸🇵🇸🇵🇸🇵🇸🇵🇸🇵🇸","745":"🤍🖤🤍🖤🤍🖤","746":"Info loker Min @hm","747":"@hm share or donate please for God save my son life","748":"@hm https:\/\/gofund.me\/cb989807","749":"Terrible customer service- I have a faulty item and your customer service will not help me! I am going to take this matter forward with the consumer ombudsman!","750":"So chic 🔥🔥🔥","751":"👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍","752":"An itibariyle One Tower AVM Personel yok  kasa yok ilgi yok","753":"Edgy and cool 🔥🔥","754":"Vi los blazer de Paula Chaves! hermoso desde Argentina!","755":"bring back the orange cotton twill overshirt","756":"https:\/\/www.instagram.com\/p\/C6axatFMNid\/?igsh=aHAwd2dwM282bjZo","757":"😍😍","758":"Ceket muhteşem 😍","759":"###","760":"👏👏👏","761":"😍","762":"Worst customer service ever!","763":"Ok weird question - does any of you in the US make a return at the store and they ask for your ID - like seriously I feel being profiled for something that was my right to do doing a return","764":"@_xgeorgina kan je me dm lezen","765":"Cool✨👌","766":"😍😍😍","767":"How the light falls on her skin, remarkable 😍😍😍","768":"HM 👍..","769":"Faciasınız gerçekten. Defalarca defalarca online alışveriş yapmaya çalışıyorum. Bankadan para çekiliyor ama sipariş oluşmuyor. En basit alışveriş platformunda bile bunu yaşamazken sizde nasıl bir aymazlık var. Peki aramama rağmen ücretin tekrar iade edilmemesi.","770":"Here for the texture 🫶🏽","771":"Love ❤️","772":"Love😍","773":"So nice❤️","774":"Cekete bayıldım 😍","775":"😍😍😍😍","776":"Code for shorts?","777":"😍😍😍😍😍❤️❤️❤️","778":"LOVEEE","779":"Image 1:\nBlazer 1228887002\n\nImage 2:\nPrinted top 1225811001","780":"Han den 🖤🖤🖤🖤💜💜💜💜","781":"Thanks 😍","782":"@hmmedellin Colombia","783":"@h_m_2727 Hi there! How can we help?","784":"Hiii","785":"nice wear","786":"It’s 2024 Ditch animal cruelty- ditch down now!","787":"I just can’t get far enough out of this pain😭💔am about to commit suicide,I need someone to talk to who can understand what am going through","788":"😍","789":"Ditch the down","790":"Hello,\nRespected \n\nI Recently Saw Your Profile And Am Really Impressed To See It.\n\nDear, I think We Built A Great Business Relation Together.\nI wanted to work as your manufacturing partners.\nI Introduce Myself As CEO Of Chic International.\nWe are the manufacturer and exporter of Sports Wears and Sports Goods.\nOEM and ODM orders accepted.\nIf you are interested,  i  explain you more about my company.\n\nThank you.","791":"","792":"🔥","793":"@luzadriana_puerta ¡Hola! Puedes encontrar disponibilidad y precio de este artículo en el buscador de la web de H&M introduciendo el siguiente número de artículo: 1220281005. ¡Un saludo!","794":"🇵🇸♥️✨","795":"@_anakorangy beli beli","796":"@cindymmaharani ini loh","797":"@nur_alfiyanti18","798":"Es pic ke click karne Wale ko 7 topho se salami deni chahiye 😂","799":"Wha 👏 ji wha wha hm aslen members kisne higher kiye btao 😂🤦👉","800":"belikkan ini samaku tolong @cutmutiaaaaaa","801":"https:\/\/www.instagram.com\/p\/C6axatFMNid\/?igsh=aHAwd2dwM282bjZo","802":"Hm??,","803":"Precio","804":"@march_viankaa @hdzfhryy__","805":"🔥🔥🔥🔥","806":"Bad picture","807":"Hello, I had a problem with a purchase. The payment was generated 3 times on my credit card but not\n the purchase was made. Can you help me?","808":"Hello, I had a problem with a purchase. The payment was generated 3 times on my credit card but not\n the purchase was made. Can you help me?","809":"Beautiful bikini! 🥰🥰🥰 I finally start seeing Brazilian-like bikini! They are so much more feminine! 🥰","810":"@dfebiani_1325 Hey fashionista, time to get ready for summer! To view the price and availability of this trendy swimsuit in your country, please search the article numbers 1220281005 and 1224686002 on our website. Happy shopping!","811":"How much","812":"🇵🇸🇵🇸🇵🇸🇵🇸","813":"Creativity","814":"Land grabbing, violence and illegal deforestation in Brazil is your game with your bestie @zara","815":"🔥🔥🔥🔥🔥","816":"🔥🔥🔥🔥🔥🙌","817":"🔥🔥🔥","818":"Hello, thank you for getting in touch with us. If you are interested in checking product availability and prices, we recommend visiting the nearest H&M store or accessing the H&M website.\nhttps:\/\/eg.hm.com\/en\/\nFor store locations, please click on the link below:\nhttps:\/\/locations.alshaya.com\/h-m\/eg","819":"😢","820":"When will the sale start in India ?","821":"❤️🔥","822":"What is this @hm 😂😂😂","823":"😂","824":"❤️","825":"@rizqifebrian24_ LANGSUNG BELI INI MAH","826":"@xiokek_ sung ajee","827":"@hm  Egypt","828":"Beautiful 😻","829":"@josh_seiter_official most stores don’t accept returns if tags have been taken off. Welcome to shopping 😂","830":"Image 1:\nSwimsuit 1217609001\n\nImage 2:\nBikini top 1240239003\nBikini bottom 1223367003\n\nImage 3:\nBikini top 1240512005\nBikini bottoms 1227251016","831":"ürünler çok kaliteli","832":"DISGUSTING COMPANY!!!","833":"Please don't kill animals😔👎","834":"😍🔥","835":"🇵🇸🇵🇸🇵🇸🇵🇸🇵🇸🇵🇸🇵🇸🇵🇸🇵🇸🇵🇸🇵🇸🇵🇸","836":"https:\/\/www.instagram.com\/p\/C6axatFMNid\/?igsh=aHAwd2dwM282bjZo","837":"Image 1:\nSwimsuit 1217609001\n\nImage 2:\nBikini top 1240239003\nBikini bottom 1223367003\n\nImage 3:\nBikini top 1240512005\nBikini bottoms 1227251016","838":"@chelseydenhaaggx kan je me dm sturen","839":"الكولكشن خيااااالي","840":"Land grabbing, violence and illegal deforestation in Brazil is your game with your bestie @zara","841":"@raveenanair_08 Uh-oh! Please DM us with your query, so that we can assist further. Hope to hear from you soon!","842":"Waiting for my order to be picked up since 3+ week and nobody yet picked it up.. its really harsh for telling customers to suffer so much","843":"❤️","844":"😍😍😍😍","845":"🔥😍😍😍","846":"Hur ska man få någon som helst koll på hur kläderna ser ut på oss som inte tillhör de få som är såpass smala\/magra? 😐","847":"So nice🔥🔥🔥🔥","848":"😍","849":"Image 1:\nSwimsuit 1217609001\n\nImage 2:\nBikini top 1240239003\nBikini bottom 1223367003\n\nImage 3:\nBikini top 1240512005\nBikini bottoms 1227251016","850":"👏👏","851":"كوبون اتش ام T710✨","852":"@hm hoppas att ni läser @karinkajjan artikel i @goteborgsposten","853":"@anakellycss Nós também amamos essa coleção!","854":"❤️😍","855":"#stopfastfashion #payyourworkers","856":"@hm Linda coleção 😘","857":"🌞🏞🏝","858":"@livvvkramer kan je me dm sturen","859":"Montana X ft DjEago4️⃣4️⃣4️⃣👁️❤️🇨🇦💀😎🕷️DjEago XO CAPALOT Records Check me out on my YouTube channel at Montana X Universe","860":"Ipanema@","861":"@ktmay31 Thanks for confirming. Please keep a close eye out as we phase this into our stores soon. Take care.","862":"@hm Thank you! I'd be shopping in England Bristol","863":"Adoro o Rio.","864":"Verified Nigga !!","865":"Image 1:\nSwimsuit 1217609001\n\nImage 2:\nBikini top 1240239003\nBikini bottom 1223367003\n\nImage 3:\nBikini top 1240512005\nBikini bottoms 1227251016","866":"❤️❤️","867":"❤️❤️❤️❤️❤️","868":"@ktmay31 Hello! We'd love to help look into this for you. Please let us know which country you are shopping from. Speak with you soon!","869":"When is swimwear going in stores please?","870":"❤️🙌🔥","871":"وو٣٣-٦ن","872":"😍","873":"@anakellycss em que podemos ajudar?","874":"Olá Brasil 🇧🇷","875":"🔥❤","876":"😍","877":"At the best beach 🤙🏻","878":"Rio de janeiro??","879":"😍😍😍😍","880":"😎","881":"#DitchDown 🦆🪿","882":"😍","883":"🇵🇸","884":"https:\/\/www.instagram.com\/p\/C6axatFMNid\/?igsh=aHAwd2dwM282bjZo","885":"I love 🕶❤️","886":"😍","887":"","888":"@hm hoppas att ni läser @karinkajjan artikel i @goteborgsposten","889":"@noormoke","890":"@rachel.rsmln kan je me dm sturen","891":"Bu ko'zoynaklar faqat ayollar Uchunmi?","892":"איזה סניף יש בגדי הריון?","893":"😍","894":"🔥🔥","895":"@denise_327 same here !!! I’ve called the last three days and they keep saying it will be sorted ‘within a few hours’. There is no notice on their website though so people are continuing to shop 🧐 xx","896":"😍 🕶","897":"😍😍","898":"Please bring more Spongebob collaborations💛🩷🩵❤️🤍💚🍍🧽","899":"😍","900":"@carowuyts_ 😎😎😎","901":"@denise_327 Hi there! Please DM us your query, so we can try to assist. Thanks!","902":"@hm Any customer service? Package lost, no updated tracking available. Chat service not working and customer service says all their tech is down??","903":"🔥🔥","904":"HM 👍..","905":"No official store in Bangladesh","906":"@marievervoort 😎","907":"مرحبًا، نحن نضع مصلحتك في قلبنا وسيسعدنا أن نقدم لك المساعدة. هل يمكنك تأكيد البلد الذي تقوم بالتسوق منه حاليًا؟ هذه المعلومة ستساعدنا في تقديم المساعدة المناسبة لك.","908":"WORST PLACE TO WORK EVER! Incredible amateurs all the team of administration and managers .. contract delay, let me know te last day of my proof day that is \"not a match\", manager giving not feedback when was asked before, not precise when the payment will come and on top of that they make a mistake in my payment I need to pay back.. what a nightmare this company!","909":"😍😍😍😍😍","910":"👏👏👏👏","911":"P","912":"👏👏","913":"اكم سعر","914":"😎","915":"😍😍😍🔥🔥","916":"❤️","917":"❤","918":"🔥😍","919":"🚀👌","920":"الفضل لله كل مين جرب خَلَلَلَلَطّتّيِّ لَلَتّفِّتّيِّيِّيِّيِّحٌ شكر منها وعاد التجربة❤️‍🔥","921":"😍😍😍","922":"🙌🙌🙌","923":"Image 1:\nSunglasses 1071879003\nImage 2:\nSunglasses 1226714003","924":"Image 1:\nSwimsuit 1209690002\n\nImage 2:\nBikini top 1115638001\nBikini bottom 1217611001","925":"Mᴀsᴛ ᴍᴀʟ ʙᴀᴀ","926":"Hello,\nRespected \n\nI Recently Saw Your Profile And Am Really Impressed To See It.\n\nDear, I think We Built A Great Business Relation Together.\nI wanted to work as your manufacturing partners.\nI Introduce Myself As CEO Of Chic International.\nWe are the manufacturer and exporter of Sports Wears and Sports Goods.\nOEM and ODM orders accepted.\nIf you are interested,  i  explain you more about my company.\n\nThank you.","927":"😍","928":"😍😍😍😍","929":"❤️❤️❤️❤️","930":"Image 1:\nSwimsuit 1209690002\n\nImage 2:\nBikini top 1115638001\nBikini bottom 1217611001","931":"Ig de la foto 2","932":"Везер Репорт?","933":"Please bring more Spongebob collaborations💛🩷🩵❤️🤍💚🍍🧽","934":"Obsessed","935":"😍","936":"WORST PLACE TO WORK EVER! Incredible amateurs all the team of administration and managers .. contract delay, let me know te last day of my proof day that is \"not a match\", manager giving not feedback when was asked before, not precise when the payment will come and on top of that they make a mistake in my payment I need to pay back.. what a nightmare this company!","937":"😍","938":"♡♡♡♡","939":"😍😍","940":"❤️","941":"🔥","942":"🔥🔥🔥","943":"🔥🔥🔥","944":"Image 1:\nSwimsuit 1209690002\n\nImage 2:\nBikini top 1115638001\nBikini bottom 1217611001","945":"@_.harsh._.rathore._ I had*","946":"@_.harsh._.rathore._  then again no response. So Inhad to cancel and get refund. Your customer service was great. They helped me smoothly with the process but I wish I could say same for the website order.","947":"NOT A PLEASANT FIRST ORDER EXPERIENCE!! I placed my first order directly from your website and it did not left your warehouse for more than a week and you guys say max 2-7 days. Then I called and complained only to know it's stuck and I waited for 2 more days","948":"Can I get her number.","949":"#whomademyclothes","950":"@hm Is that true that you use cotton from Cerrado? Is that true that your cotton is not only not certified but sourced in violent and corrupted way in wild forests of Brazil???","951":"❤️❤️","952":"😍😍","953":"😍","954":"🔥","955":"S u b l I m e - i n - b l a c k s u I t \n\n❤️like if you’re agreeeeeee","956":"❤️","957":"@hm","958":"Antalya Mallofantalya mağzanızda ki kadın  çalışan kasiyerinizin zorbalığna mağruz kaldığımı bildirmek isterim.Mağzanızda  krdi kartım limiti yok diye ürün satışı yapılamdı ve limiti olmayan kart fişini istdim fakat veremeyeceklerini söylediler. Israr edin ce de Limiti olmayan fişi mağaza tarafından kullanılacağını belirtti kadın çalışan kasiyeriniz.Bana zorluk ,sorun çıkartığımı belirterek bana kasada zorbalık ve küçümsyen davranışlar sergiledi.","959":"😍","960":"Image 1:\nSwimsuit 1209690002\n\nImage 2:\nBikini top 1115638001\nBikini bottom 1217611001","961":"Gonna be as big as them one day 🤌🏽","962":"Worst customer service!❌❌❌❌❌","963":"","964":"Free Palestine 🇵🇸🇵🇸","965":"Anda que va a bucear un monton sin agua","966":"🦋","967":"مقاطعة ❌","968":"🙌🏿","969":"😍😍","970":"🏊🏽‍♀️🏊🏽‍♀️👏🏽","971":"❤️❤️","972":"@claudia.panico.1 mi hai riconosciuta per la maschera?😅","973":"HM 👍.."},"date":{"0":1715874547000,"1":1715873438000,"2":1715872989000,"3":1715865240000,"4":1715862203000,"5":1715852322000,"6":1715842041000,"7":1715835541000,"8":1715830508000,"9":1715865350000,"10":1715865318000,"11":1715865315000,"12":1715776590000,"13":1715767685000,"14":1715755466000,"15":1715780047000,"16":1715775812000,"17":1715774126000,"18":1715681384000,"19":1715516786000,"20":1715432497000,"21":1715610706000,"22":1715560840000,"23":1715410768000,"24":1715854896000,"25":1715517828000,"26":1715381980000,"27":1715835990000,"28":1715796933000,"29":1715781960000,"30":1715778825000,"31":1715496076000,"32":1715470839000,"33":1715842006000,"34":1715700896000,"35":1715580579000,"36":1715723587000,"37":1715681969000,"38":1715259392000,"39":1715664472000,"40":1715415005000,"41":1715353584000,"42":1715762921000,"43":1715082192000,"44":1715079502000,"45":1715016642000,"46":1715010792000,"47":1714932671000,"48":1715422321000,"49":1715249048000,"50":1715222287000,"51":1714132253000,"52":1715083416000,"53":1714792525000,"54":1714867444000,"55":1714648381000,"56":1714635251000,"57":1713862139000,"58":1715037805000,"59":1714673445000,"60":1715875017000,"61":1715874547000,"62":1715873438000,"63":1715872989000,"64":1715871321000,"65":1715870930000,"66":1715870344000,"67":1715870338000,"68":1715869955000,"69":1715869785000,"70":1715869437000,"71":1715867114000,"72":1715867023000,"73":1715866607000,"74":1715865861000,"75":1715865698000,"76":1715865340000,"77":1715865164000,"78":1715864999000,"79":1715864438000,"80":1715864209000,"81":1715864086000,"82":1715864038000,"83":1715863927000,"84":1715863611000,"85":1715863610000,"86":1715863600000,"87":1715863460000,"88":1715863411000,"89":1715863408000,"90":1715865240000,"91":1715862203000,"92":1715852322000,"93":1715852258000,"94":1715852154000,"95":1715850109000,"96":1715850074000,"97":1715849902000,"98":1715847530000,"99":1715847116000,"100":1715845063000,"101":1715844967000,"102":1715842027000,"103":1715839911000,"104":1715835351000,"105":1715831550000,"106":1715811224000,"107":1715810013000,"108":1715804146000,"109":1715799498000,"110":1715796954000,"111":1715795772000,"112":1715793332000,"113":1715792477000,"114":1715790153000,"115":1715789806000,"116":1715789782000,"117":1715788067000,"118":1715785860000,"119":1715785456000,"120":1715785002000,"121":1715784339000,"122":1715780776000,"123":1715779621000,"124":1715779524000,"125":1715779050000,"126":1715778481000,"127":1715777846000,"128":1715776756000,"129":1715774570000,"130":1715773439000,"131":1715773204000,"132":1715771453000,"133":1715771170000,"134":1715770905000,"135":1715770038000,"136":1715769618000,"137":1715769587000,"138":1715768996000,"139":1715768667000,"140":1715842041000,"141":1715835541000,"142":1715830508000,"143":1715810933000,"144":1715806977000,"145":1715805618000,"146":1715803328000,"147":1715801170000,"148":1715795795000,"149":1715775089000,"150":1715773462000,"151":1715769017000,"152":1715768993000,"153":1715767584000,"154":1715766758000,"155":1715766211000,"156":1715765132000,"157":1715764092000,"158":1715763420000,"159":1715762026000,"160":1715758905000,"161":1715757675000,"162":1715757604000,"163":1715756948000,"164":1715755949000,"165":1715753781000,"166":1715731778000,"167":1715729070000,"168":1715729005000,"169":1715728382000,"170":1715723957000,"171":1715722332000,"172":1715720690000,"173":1715718889000,"174":1715717415000,"175":1715717402000,"176":1715717379000,"177":1715716368000,"178":1715716307000,"179":1715716043000,"180":1715715174000,"181":1715715082000,"182":1715711136000,"183":1715711106000,"184":1715711037000,"185":1715710963000,"186":1715710251000,"187":1715710152000,"188":1715705882000,"189":1715705107000,"190":1715865350000,"191":1715865318000,"192":1715865315000,"193":1715865313000,"194":1715865308000,"195":1715865302000,"196":1715865292000,"197":1715865283000,"198":1715775986000,"199":1715767670000,"200":1715755956000,"201":1715736001000,"202":1715716055000,"203":1715687186000,"204":1715674885000,"205":1715669907000,"206":1715665072000,"207":1715663953000,"208":1715661559000,"209":1715660795000,"210":1715658293000,"211":1715654219000,"212":1715647756000,"213":1715646887000,"214":1715642330000,"215":1715640142000,"216":1715635773000,"217":1715635761000,"218":1715634111000,"219":1715629532000,"220":1715627715000,"221":1715627099000,"222":1715625269000,"223":1715625260000,"224":1715622793000,"225":1715620085000,"226":1715618899000,"227":1715617754000,"228":1715616672000,"229":1715610693000,"230":1715610679000,"231":1715610453000,"232":1715608339000,"233":1715606138000,"234":1715604208000,"235":1715599672000,"236":1715595803000,"237":1715591157000,"238":1715591152000,"239":1715591142000,"240":1715776590000,"241":1715767685000,"242":1715755466000,"243":1715702706000,"244":1715699517000,"245":1715684381000,"246":1715665077000,"247":1715623640000,"248":1715591185000,"249":1715553533000,"250":1715540582000,"251":1715540498000,"252":1715509678000,"253":1715507301000,"254":1715497834000,"255":1715497814000,"256":1715491806000,"257":1715489515000,"258":1715463216000,"259":1715459618000,"260":1715450188000,"261":1715444601000,"262":1715421925000,"263":1715416091000,"264":1715412817000,"265":1715399034000,"266":1715395795000,"267":1715390664000,"268":1715386246000,"269":1715383244000,"270":1715381698000,"271":1715375703000,"272":1715369036000,"273":1715362500000,"274":1715361075000,"275":1715359352000,"276":1715358678000,"277":1715358290000,"278":1715355639000,"279":1715352303000,"280":1715351909000,"281":1715351711000,"282":1715350091000,"283":1715348366000,"284":1715347766000,"285":1715347259000,"286":1715346860000,"287":1715345260000,"288":1715345124000,"289":1715344981000,"290":1715780047000,"291":1715775812000,"292":1715774126000,"293":1715746524000,"294":1715735326000,"295":1715698174000,"296":1715688789000,"297":1715661281000,"298":1715635641000,"299":1715635591000,"300":1715635424000,"301":1715617984000,"302":1715555431000,"303":1715553538000,"304":1715534037000,"305":1715502052000,"306":1715494529000,"307":1715491036000,"308":1715456507000,"309":1715423175000,"310":1715418875000,"311":1715418295000,"312":1715376772000,"313":1715367160000,"314":1715360793000,"315":1715352990000,"316":1715351439000,"317":1715348333000,"318":1715347428000,"319":1715345533000,"320":1715340578000,"321":1715340335000,"322":1715336910000,"323":1715336502000,"324":1715336359000,"325":1715329932000,"326":1715327078000,"327":1715326372000,"328":1715319300000,"329":1715308914000,"330":1715306921000,"331":1715294956000,"332":1715294634000,"333":1715294361000,"334":1715292994000,"335":1715290858000,"336":1715289020000,"337":1715287334000,"338":1715285712000,"339":1715285211000,"340":1715681384000,"341":1715516786000,"342":1715432497000,"343":1715239119000,"344":1715207103000,"345":1715204012000,"346":1715193352000,"347":1715191004000,"348":1715189909000,"349":1715185039000,"350":1715184037000,"351":1715183650000,"352":1715175826000,"353":1715167909000,"354":1715166583000,"355":1715166541000,"356":1715166360000,"357":1715166149000,"358":1715610706000,"359":1715560840000,"360":1715410768000,"361":1715390434000,"362":1715344902000,"363":1715333130000,"364":1715323124000,"365":1715322445000,"366":1715309843000,"367":1715214449000,"368":1715198518000,"369":1715195999000,"370":1715194125000,"371":1715193772000,"372":1715191250000,"373":1715191010000,"374":1715177039000,"375":1715173991000,"376":1715173196000,"377":1715168707000,"378":1715168508000,"379":1715164573000,"380":1715159520000,"381":1715159462000,"382":1715157672000,"383":1715151750000,"384":1715150755000,"385":1715150441000,"386":1715854896000,"387":1715517828000,"388":1715381980000,"389":1715340986000,"390":1715248991000,"391":1715233055000,"392":1715202090000,"393":1715198072000,"394":1715193747000,"395":1715192222000,"396":1715191016000,"397":1715181896000,"398":1715181739000,"399":1715177130000,"400":1715173817000,"401":1715172405000,"402":1715170635000,"403":1715159249000,"404":1715156985000,"405":1715156034000,"406":1715154755000,"407":1715154645000,"408":1715147197000,"409":1715145855000,"410":1715141936000,"411":1715130358000,"412":1715127293000,"413":1715126997000,"414":1715126181000,"415":1715125723000,"416":1715125703000,"417":1715124089000,"418":1715123364000,"419":1715122319000,"420":1715121594000,"421":1715120250000,"422":1715117929000,"423":1715117791000,"424":1715116377000,"425":1715116189000,"426":1715116097000,"427":1715116019000,"428":1715115566000,"429":1715115331000,"430":1715115328000,"431":1715114794000,"432":1715835990000,"433":1715796933000,"434":1715781960000,"435":1715773291000,"436":1715773227000,"437":1715761473000,"438":1715761452000,"439":1715682105000,"440":1715623306000,"441":1715576879000,"442":1715448310000,"443":1715431076000,"444":1715374080000,"445":1715357285000,"446":1715344199000,"447":1715342526000,"448":1715327950000,"449":1715274238000,"450":1715268484000,"451":1715266356000,"452":1715264308000,"453":1715262964000,"454":1715259557000,"455":1715249014000,"456":1715213828000,"457":1715198122000,"458":1715192241000,"459":1715182231000,"460":1715175425000,"461":1715173635000,"462":1715171311000,"463":1715169105000,"464":1715139985000,"465":1715137417000,"466":1715131719000,"467":1715115046000,"468":1715113855000,"469":1715113290000,"470":1715112767000,"471":1715112377000,"472":1715112003000,"473":1715111100000,"474":1715110892000,"475":1715110327000,"476":1715110014000,"477":1715109334000,"478":1715109331000,"479":1715109330000,"480":1715108782000,"481":1715107703000,"482":1715778825000,"483":1715496076000,"484":1715470839000,"485":1715406707000,"486":1715402878000,"487":1715378642000,"488":1715359016000,"489":1715358039000,"490":1715349735000,"491":1715349643000,"492":1715334942000,"493":1715332795000,"494":1715327826000,"495":1715323654000,"496":1715315771000,"497":1715314469000,"498":1715313283000,"499":1715295382000,"500":1715291804000,"501":1715289632000,"502":1715276778000,"503":1715275296000,"504":1715275283000,"505":1715275277000,"506":1715275271000,"507":1715275257000,"508":1715275245000,"509":1715275217000,"510":1715274464000,"511":1715273409000,"512":1715272972000,"513":1715272749000,"514":1715268148000,"515":1715267995000,"516":1715264814000,"517":1715264753000,"518":1715264185000,"519":1715263969000,"520":1715262925000,"521":1715261954000,"522":1715261564000,"523":1715258482000,"524":1715258136000,"525":1715241808000,"526":1715239324000,"527":1715237155000,"528":1715235481000,"529":1715235231000,"530":1715235122000,"531":1715233156000,"532":1715842006000,"533":1715700896000,"534":1715580579000,"535":1715427664000,"536":1715378592000,"537":1715364836000,"538":1715341993000,"539":1715341991000,"540":1715331583000,"541":1715294420000,"542":1715255358000,"543":1715250607000,"544":1715246873000,"545":1715206255000,"546":1715184231000,"547":1715173560000,"548":1715162724000,"549":1715159423000,"550":1715155272000,"551":1715154861000,"552":1715148128000,"553":1715147379000,"554":1715138698000,"555":1715138149000,"556":1715130973000,"557":1715128977000,"558":1715125565000,"559":1715123486000,"560":1715122737000,"561":1715122054000,"562":1715114386000,"563":1715114284000,"564":1715114231000,"565":1715110890000,"566":1715110097000,"567":1715106161000,"568":1715105660000,"569":1715101316000,"570":1715100797000,"571":1715098932000,"572":1715098859000,"573":1715098746000,"574":1715097878000,"575":1715096199000,"576":1715096196000,"577":1715094571000,"578":1715094519000,"579":1715094307000,"580":1715094089000,"581":1715094086000,"582":1715723587000,"583":1715681969000,"584":1715259392000,"585":1715249031000,"586":1715238545000,"587":1715153800000,"588":1715109354000,"589":1715109352000,"590":1715109351000,"591":1715106810000,"592":1715092541000,"593":1715084461000,"594":1715080917000,"595":1715074007000,"596":1715073773000,"597":1715073483000,"598":1715070434000,"599":1715066099000,"600":1715039578000,"601":1715029732000,"602":1715029332000,"603":1715025809000,"604":1715022054000,"605":1715010461000,"606":1715000419000,"607":1714982418000,"608":1714970794000,"609":1714967743000,"610":1714957180000,"611":1714957129000,"612":1714940345000,"613":1714940002000,"614":1714936795000,"615":1714931973000,"616":1714931287000,"617":1714923746000,"618":1714917521000,"619":1714917415000,"620":1714914463000,"621":1714905016000,"622":1714901500000,"623":1714901497000,"624":1714901495000,"625":1714901492000,"626":1714901489000,"627":1714901487000,"628":1714901485000,"629":1714901484000,"630":1714901483000,"631":1714901481000,"632":1715664472000,"633":1715415005000,"634":1715353584000,"635":1715348630000,"636":1715328799000,"637":1715247062000,"638":1715236520000,"639":1715062818000,"640":1715053915000,"641":1714987708000,"642":1714976489000,"643":1714937644000,"644":1714936897000,"645":1714936711000,"646":1714907769000,"647":1714901522000,"648":1714901521000,"649":1714901519000,"650":1714901516000,"651":1714901512000,"652":1714900880000,"653":1714895501000,"654":1714881045000,"655":1714865882000,"656":1714855922000,"657":1714853020000,"658":1714845576000,"659":1714835731000,"660":1714828700000,"661":1714827419000,"662":1714821195000,"663":1714792480000,"664":1714790017000,"665":1714751793000,"666":1714750771000,"667":1714748704000,"668":1714746483000,"669":1714741970000,"670":1714741873000,"671":1714741821000,"672":1714740078000,"673":1714739679000,"674":1714739490000,"675":1714735624000,"676":1714734698000,"677":1714733280000,"678":1714728169000,"679":1714728121000,"680":1714727349000,"681":1714727347000,"682":1715762921000,"683":1715082192000,"684":1715079502000,"685":1714967619000,"686":1714951924000,"687":1714946781000,"688":1714942634000,"689":1714920810000,"690":1714900996000,"691":1714845568000,"692":1714835749000,"693":1714832579000,"694":1714809249000,"695":1714807224000,"696":1714802308000,"697":1714792494000,"698":1714755603000,"699":1714755329000,"700":1714746446000,"701":1714733300000,"702":1714728131000,"703":1714727381000,"704":1714726482000,"705":1714726328000,"706":1714723355000,"707":1714723014000,"708":1714717234000,"709":1714707859000,"710":1714705130000,"711":1714701157000,"712":1714694334000,"713":1714681411000,"714":1714680818000,"715":1714677117000,"716":1714673610000,"717":1714671585000,"718":1714671012000,"719":1714667623000,"720":1714663909000,"721":1714663671000,"722":1714661905000,"723":1714659337000,"724":1714659150000,"725":1714656732000,"726":1714654909000,"727":1714654128000,"728":1714653185000,"729":1714653120000,"730":1714651339000,"731":1714649913000,"732":1715016642000,"733":1715010792000,"734":1714932671000,"735":1714901251000,"736":1714901222000,"737":1714815384000,"738":1714727432000,"739":1714648140000,"740":1714640219000,"741":1714637072000,"742":1714636808000,"743":1714634932000,"744":1714630419000,"745":1714625284000,"746":1714620572000,"747":1714603532000,"748":1714603523000,"749":1714597343000,"750":1714596931000,"751":1714594800000,"752":1714574627000,"753":1714572485000,"754":1714571768000,"755":1714571535000,"756":1714562511000,"757":1714557710000,"758":1714546505000,"759":1714543747000,"760":1714525415000,"761":1714518390000,"762":1714515885000,"763":1714508543000,"764":1714505748000,"765":1714501455000,"766":1714499815000,"767":1714499603000,"768":1714498654000,"769":1714494784000,"770":1714493207000,"771":1714488944000,"772":1714488360000,"773":1714487965000,"774":1714485618000,"775":1714484255000,"776":1714482109000,"777":1714481664000,"778":1714481619000,"779":1714481613000,"780":1715422321000,"781":1715249048000,"782":1715222287000,"783":1715167735000,"784":1715148981000,"785":1715047503000,"786":1714901337000,"787":1714765599000,"788":1714680988000,"789":1714674668000,"790":1714673430000,"791":1714664544000,"792":1714634941000,"793":1714632309000,"794":1714630442000,"795":1714623235000,"796":1714623186000,"797":1714609559000,"798":1714591222000,"799":1714591159000,"800":1714579046000,"801":1714562560000,"802":1714523091000,"803":1714496635000,"804":1714482259000,"805":1714462982000,"806":1714440407000,"807":1714438073000,"808":1714433201000,"809":1714424914000,"810":1714417241000,"811":1714416537000,"812":1714414444000,"813":1714408944000,"814":1714401779000,"815":1714383298000,"816":1714381832000,"817":1714367460000,"818":1714361609000,"819":1714342904000,"820":1714327846000,"821":1714316599000,"822":1714314143000,"823":1714314064000,"824":1714313757000,"825":1714312356000,"826":1714311681000,"827":1714310936000,"828":1714261904000,"829":1714253780000,"830":1714132253000,"831":1715083416000,"832":1714792525000,"833":1714648522000,"834":1714634967000,"835":1714630457000,"836":1714562659000,"837":1714132253000,"838":1714516783000,"839":1714496782000,"840":1714401788000,"841":1714400887000,"842":1714389290000,"843":1714316632000,"844":1714260547000,"845":1714260197000,"846":1714255328000,"847":1714250454000,"848":1714249272000,"849":1714132253000,"850":1714229231000,"851":1714220987000,"852":1714210820000,"853":1714209111000,"854":1714205662000,"855":1714203172000,"856":1714200923000,"857":1714196108000,"858":1714168733000,"859":1714159992000,"860":1714154615000,"861":1714154578000,"862":1714153529000,"863":1714153516000,"864":1714153145000,"865":1714132253000,"866":1714152973000,"867":1714152706000,"868":1714152668000,"869":1714152174000,"870":1714148865000,"871":1714147297000,"872":1714144696000,"873":1714142735000,"874":1714141465000,"875":1714139750000,"876":1714137997000,"877":1714137603000,"878":1714133567000,"879":1714133257000,"880":1714867444000,"881":1714648381000,"882":1714635251000,"883":1714630491000,"884":1714562676000,"885":1714262387000,"886":1714231118000,"887":1714216446000,"888":1714210865000,"889":1714202774000,"890":1714156918000,"891":1714146580000,"892":1714114439000,"893":1714099605000,"894":1714094393000,"895":1714078305000,"896":1714077665000,"897":1714063348000,"898":1714061713000,"899":1714061558000,"900":1714060426000,"901":1714059343000,"902":1714058797000,"903":1714055512000,"904":1714052477000,"905":1714045925000,"906":1714044330000,"907":1714044156000,"908":1714041755000,"909":1714038157000,"910":1714038155000,"911":1714037852000,"912":1714036977000,"913":1714036877000,"914":1714036325000,"915":1714035523000,"916":1714035104000,"917":1714035097000,"918":1714035023000,"919":1714034812000,"920":1714034754000,"921":1714034726000,"922":1714034630000,"923":1714034592000,"924":1713862139000,"925":1715037805000,"926":1714673445000,"927":1714578264000,"928":1714260449000,"929":1714124000000,"930":1713862139000,"931":1714091070000,"932":1714079241000,"933":1714061721000,"934":1714055646000,"935":1714050278000,"936":1714041764000,"937":1714029924000,"938":1713996915000,"939":1713986106000,"940":1713984125000,"941":1713976863000,"942":1713971639000,"943":1713970754000,"944":1713862139000,"945":1713947990000,"946":1713947981000,"947":1713947899000,"948":1713942388000,"949":1713941931000,"950":1713938794000,"951":1713931809000,"952":1713924781000,"953":1713913730000,"954":1713905091000,"955":1713902571000,"956":1713901985000,"957":1713898572000,"958":1713898489000,"959":1713898485000,"960":1713862139000,"961":1713890427000,"962":1713889926000,"963":1713885455000,"964":1713883340000,"965":1713882073000,"966":1713879057000,"967":1713877156000,"968":1713876225000,"969":1713875751000,"970":1713873667000,"971":1713871025000,"972":1713870301000,"973":1713869959000}}